* Materiaalit

Kotelon rakentamisessa käytettävät materiaalit:

- Akryyli: paksuus 3mm
- Kotelon liimaus: Acrfix 116
- Kytkentäjohto: 2.5 mm^2

Laskelma akryylin kulutuksesta
#+BEGIN_SRC python :eval no-export :results output :noweb no  :exports both
syvyys = 0.17
korkeus = 0.1
leveys = 0.11
nurkkapala = 0.05
leikkausvara = 10
ala = 2*(syvyys * leveys) + \
      2*(leveys * syvyys ) + \
      2* (syvyys * korkeus) + \
      2* ( nurkkapala * nurkkapala )
print( "Akryylin kulutus: Kotelo n. {:.2f}m^2 * leikkausvara {}% = n. {:.2f}m^2".
    format(ala, leikkausvara+100, ala*(100+leikkausvara)/100) )
#+END_SRC

#+RESULTS:
: Akryylin kulutus: Kotelo n. 0.11m^2 * leikkausvara 110% = n. 0.13m^2


